<?php
// for文を用いて以下を作成してください。
// ****1
// ***121
// **12321
// *1234321
// 123454321
// *1234321
// **12321
// ***121
// ****1

for($a =1; $a <= 4; $a ++) {
  for($b = 4; $b >= $a; $b --) {
    echo "*";
  }
  for($c = 1; $c <= $a; $c++) {
    echo $c;
  }
  for($d = 3; $d >= 5-$a; $d--) {
    echo $d-(4-$a);
  }
  echo '<br>';
}

for($a = 1; $a <= 5 ; $a++) { 
  for($b = 2; $b <= $a; $b++) {
    echo "*";
  }
  for ($c = 1; $c <= 6-$a; $c++) {
    echo $c;
  }
  for ($d = 5-$a; $d >= 1; $d--) {
    echo $d;
  }
  echo '<br>';
}